{
  "storage" : "model.espresso.weights",
  "properties" : {

  },
  "format_version" : 200,
  "layers" : [
    {
      "name" : "data_bn",
      "bottom" : "data",
      "weights" : {

      },
      "top" : "data_bn",
      "C" : 3,
      "blob_batchnorm_params" : 1,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv1",
      "blob_weights" : 5,
      "K" : 3,
      "blob_biases" : 3,
      "stride_x" : 2,
      "name" : "conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "data_bn",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 0,
      "top_shape_style" : 2,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 0,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "conv1",
      "pad_l" : 0,
      "name" : "pool1",
      "top" : "pool1"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire2\/squeeze1x1",
      "blob_weights" : 9,
      "K" : 64,
      "blob_biases" : 7,
      "name" : "fire2\/squeeze1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "pool1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire2\/expand1x1",
      "blob_weights" : 13,
      "K" : 16,
      "blob_biases" : 11,
      "name" : "fire2\/expand1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "fire2\/squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "fire2\/expand3x3",
      "blob_weights" : 17,
      "K" : 16,
      "blob_biases" : 15,
      "name" : "fire2\/expand3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "fire2\/squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "fire2\/concat",
      "type" : "concat",
      "name" : "fire2\/concat",
      "bottom" : "fire2\/expand1x1,fire2\/expand3x3"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire3\/squeeze1x1",
      "blob_weights" : 21,
      "K" : 128,
      "blob_biases" : 19,
      "name" : "fire3\/squeeze1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "fire2\/concat",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire3\/expand1x1",
      "blob_weights" : 25,
      "K" : 16,
      "blob_biases" : 23,
      "name" : "fire3\/expand1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "fire3\/squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "fire3\/expand3x3",
      "blob_weights" : 29,
      "K" : 16,
      "blob_biases" : 27,
      "name" : "fire3\/expand3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "fire3\/squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "fire3\/concat",
      "type" : "concat",
      "name" : "fire3\/concat",
      "bottom" : "fire3\/expand1x1,fire3\/expand3x3"
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 0,
      "top_shape_style" : 2,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 0,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "fire3\/concat",
      "pad_l" : 0,
      "name" : "pool3",
      "top" : "pool3"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire4\/squeeze1x1",
      "blob_weights" : 33,
      "K" : 128,
      "blob_biases" : 31,
      "name" : "fire4\/squeeze1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "pool3",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire4\/expand1x1",
      "blob_weights" : 37,
      "K" : 32,
      "blob_biases" : 35,
      "name" : "fire4\/expand1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "fire4\/squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "fire4\/expand3x3",
      "blob_weights" : 41,
      "K" : 32,
      "blob_biases" : 39,
      "name" : "fire4\/expand3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "fire4\/squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "fire4\/concat",
      "type" : "concat",
      "name" : "fire4\/concat",
      "bottom" : "fire4\/expand1x1,fire4\/expand3x3"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire5\/squeeze1x1",
      "blob_weights" : 45,
      "K" : 256,
      "blob_biases" : 43,
      "name" : "fire5\/squeeze1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "fire4\/concat",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire5\/expand1x1",
      "blob_weights" : 49,
      "K" : 32,
      "blob_biases" : 47,
      "name" : "fire5\/expand1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "fire5\/squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "fire5\/expand3x3",
      "blob_weights" : 53,
      "K" : 32,
      "blob_biases" : 51,
      "name" : "fire5\/expand3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "fire5\/squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "fire5\/concat",
      "type" : "concat",
      "name" : "fire5\/concat",
      "bottom" : "fire5\/expand1x1,fire5\/expand3x3"
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 0,
      "top_shape_style" : 2,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 0,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "fire5\/concat",
      "pad_l" : 0,
      "name" : "pool5",
      "top" : "pool5"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire6\/squeeze1x1",
      "blob_weights" : 57,
      "K" : 256,
      "blob_biases" : 55,
      "name" : "fire6\/squeeze1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "pool5",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire6\/expand1x1",
      "blob_weights" : 61,
      "K" : 48,
      "blob_biases" : 59,
      "name" : "fire6\/expand1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "fire6\/squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "fire6\/expand3x3",
      "blob_weights" : 65,
      "K" : 48,
      "blob_biases" : 63,
      "name" : "fire6\/expand3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "fire6\/squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "fire6\/concat",
      "type" : "concat",
      "name" : "fire6\/concat",
      "bottom" : "fire6\/expand1x1,fire6\/expand3x3"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire7\/squeeze1x1",
      "blob_weights" : 69,
      "K" : 384,
      "blob_biases" : 67,
      "name" : "fire7\/squeeze1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "fire6\/concat",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire7\/expand1x1",
      "blob_weights" : 73,
      "K" : 48,
      "blob_biases" : 71,
      "name" : "fire7\/expand1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "fire7\/squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "fire7\/expand3x3",
      "blob_weights" : 77,
      "K" : 48,
      "blob_biases" : 75,
      "name" : "fire7\/expand3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "fire7\/squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "fire7\/concat",
      "type" : "concat",
      "name" : "fire7\/concat",
      "bottom" : "fire7\/expand1x1,fire7\/expand3x3"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire8\/squeeze1x1",
      "blob_weights" : 81,
      "K" : 384,
      "blob_biases" : 79,
      "name" : "fire8\/squeeze1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "fire7\/concat",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire8\/expand1x1",
      "blob_weights" : 85,
      "K" : 64,
      "blob_biases" : 83,
      "name" : "fire8\/expand1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "fire8\/squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "fire8\/expand3x3",
      "blob_weights" : 89,
      "K" : 64,
      "blob_biases" : 87,
      "name" : "fire8\/expand3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "fire8\/squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "fire8\/concat",
      "type" : "concat",
      "name" : "fire8\/concat",
      "bottom" : "fire8\/expand1x1,fire8\/expand3x3"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire9\/squeeze1x1",
      "blob_weights" : 93,
      "K" : 512,
      "blob_biases" : 91,
      "name" : "fire9\/squeeze1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "fire8\/concat",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire9\/expand1x1",
      "blob_weights" : 97,
      "K" : 64,
      "blob_biases" : 95,
      "name" : "fire9\/expand1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "fire9\/squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "fire9\/expand3x3",
      "blob_weights" : 101,
      "K" : 64,
      "blob_biases" : 99,
      "name" : "fire9\/expand3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "fire9\/squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "fire9\/concat",
      "type" : "concat",
      "name" : "fire9\/concat",
      "bottom" : "fire9\/expand1x1,fire9\/expand3x3"
    },
    {
      "pad_r" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "pool10",
      "size_x" : 14,
      "is_global" : 1,
      "top_shape_style" : 2,
      "stride_x" : 1,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 0,
      "type" : "pool",
      "name" : "pool10",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "fire9\/concat",
      "weights" : {

      },
      "pad_mode" : 0,
      "size_y" : 14,
      "pad_value" : 0
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "pool10_flattened",
      "type" : "flatten",
      "name" : "fc_preflatten",
      "bottom" : "pool10"
    },
    {
      "nB" : 512,
      "top" : "fc",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 2,
      "blob_weights" : 105,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "pool10_flattened",
      "blob_biases" : 103,
      "has_tanh" : 0,
      "name" : "fc",
      "has_prelu" : 0
    },
    {
      "mode" : 3,
      "weights" : {

      },
      "top" : "loss",
      "type" : "activation",
      "name" : "loss",
      "bottom" : "fc"
    }
  ]
}